status/2021/19nov21.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-01-28 Sat 07:05 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>13 November 2021 - 19 November 2021</title>
<meta name="author" content="Daniel Kelley" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">13 November 2021 - 19 November 2021</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgf2b7eeb">1. MIT OCW</a>
<ul>
<li><a href="#orgf20b677">1.1. 18.01 - Single Variable Calculus</a>
<ul>
<li><a href="#orgc3c16fe">1.1.1. Sessions 66-73</a></li>
</ul>
</li>
<li><a href="#org9445c63">1.2. 8.01 - Physics I - Classical Mechanics</a>
<ul>
<li><a href="#orgcc2594e">1.2.1. Sessions 35-37,DD3</a></li>
<li><a href="#orgdcc7c5e">1.2.2. Labs</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org1c11019">2. LA County index map</a></li>
<li><a href="#org2772aa7">3. Mill Controller #2</a></li>
<li><a href="#orgd05c6bb">4. WWVB Decoder</a></li>
<li><a href="#orga136a74">5. Santa Cruz Weather Station</a></li>
<li><a href="#org6d20cbc">6. Marble Computation</a>
<ul>
<li><a href="#org842d5f1">6.1. Next Steps</a>
<ul>
<li><a href="#org65a5f32">6.1.1. Continue Reversible Computation Study</a></li>
<li><a href="#org61d27ef">6.1.2. Prototype Marble inverter</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgfdb07cd">7. ca-r</a>
<ul>
<li><a href="#org391e7ee">7.1. Next Step</a></li>
</ul>
</li>
<li><a href="#org8afe8de">8. us-index-map</a>
<ul>
<li><a href="#org8af3292">8.1. error analysis</a></li>
</ul>
</li>
<li><a href="#orga37ef4d">9. Sun Ultra 10</a>
<ul>
<li><a href="#org1f57dc4">9.1. Next steps</a>
<ul>
<li><a href="#org95310d1">9.1.1. Serial debug</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org5025e1c">10. Apple iMac G4</a>
<ul>
<li><a href="#org71a4021">10.1. Next steps</a></li>
</ul>
</li>
<li><a href="#org4fb4d1d">11. Davies Brothel</a>
<ul>
<li><a href="#orgc8aee83">11.1. New case C1923172, consolidated with <b>15</b> Parties.</a></li>
<li><a href="#orgcb59c2b">11.2. Next hearing 14jan2022. Still no PACER.</a></li>
</ul>
</li>
<li><a href="#orged27513">12. Peter Kim</a>
<ul>
<li><a href="#org699fcd8">12.1. Broadcom CSG Employee indicted for trade secret theft.</a></li>
<li><a href="#orgcc412fb">12.2. United States v. Kim (5:21-cr-00438).</a></li>
<li><a href="#org6064acc">12.3. Next hearing: 1/31/2022 01:30 PM</a></li>
</ul>
</li>
<li><a href="#org4d899eb">13. Linux Audio</a>
<ul>
<li><a href="#orgb36445f">13.1. pvanal to spectrogram</a>
<ul>
<li><a href="#org00c2f76">13.1.1. Next steps</a></li>
</ul>
</li>
<li><a href="#org3a5eec7">13.2. CSound programming.</a>
<ul>
<li><a href="#org7132420">13.2.1. Next Steps</a></li>
</ul>
</li>
<li><a href="#org84d80bc">13.3. Faust programming</a>
<ul>
<li><a href="#orgdb945d0">13.3.1. Next Steps</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgb85b0b3">14. EPICS</a>
<ul>
<li><a href="#orge69b13c">14.1. Next steps</a>
<ul>
<li><a href="#org4a8abc8">14.1.1. Started CGR-101 SCPI interface</a></li>
<li><a href="#org1620777">14.1.2. u3scpi network port testing</a></li>
<li><a href="#orga3eeb91">14.1.3. initial EPICS interface</a></li>
<li><a href="#orgd37c859">14.1.4. u3scpi analog/digital port reconfiguration.</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgd7aaa62">15. Brini Tracker II</a>
<ul>
<li><a href="#org6879e74">15.1. Next steps</a>
<ul>
<li><a href="#orgf489e61">15.1.1. Validate remaining standard GPS messages</a></li>
<li><a href="#org2c20fe7">15.1.2. Investigate GPS chipset data logging</a></li>
<li><a href="#org87e3ed5">15.1.3. Investigate LoRA radio interface</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgb19bd04">16. wktcolor</a>
<ul>
<li><a href="#orgb73541d">16.1. Next steps</a>
<ul>
<li><a href="#orgd930ba2">16.1.1. Explore how to get a minimal coloring</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org22249a3">17. wktplot</a>
<ul>
<li><a href="#orgf864c32">17.1. Next steps</a></li>
</ul>
</li>
<li><a href="#orga38515d">18. AMDGPU</a>
<ul>
<li><a href="#org30f6d15">18.1. Next step</a>
<ul>
<li><a href="#org3ed3f71">18.1.1. Reverse engineer HSAKMT programming.</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org1c69e10">19. Ninja v Make</a>
<ul>
<li><a href="#orgc832e60">19.1. Next Step</a>
<ul>
<li><a href="#org95b7764">19.1.1. clean simple measurements</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orge0419da">20. GMP Forth</a>
<ul>
<li><a href="#org52d4023">20.1. Need to think about adding floating point support</a></li>
<li><a href="#org6749e60">20.2. Port to non-Linux OS</a></li>
</ul>
</li>
<li><a href="#org2e20bf7">21. Swocer</a>
<ul>
<li><a href="#org3fc9146">21.1. Most crashing addressed</a></li>
<li><a href="#orgb206532">21.2. Added outline for 'bottle' test</a></li>
<li><a href="#orgcf5f7b1">21.3. Next steps</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Beautiful Fall!
</p>

<div id="outline-container-orgf2b7eeb" class="outline-2">
<h2 id="orgf2b7eeb"><span class="section-number-2">1.</span> MIT OCW</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgf20b677" class="outline-3">
<h3 id="orgf20b677"><span class="section-number-3">1.1.</span> 18.01 - Single Variable Calculus</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-orgc3c16fe" class="outline-4">
<h4 id="orgc3c16fe"><span class="section-number-4">1.1.1.</span> Sessions 66-73</h4>
</div>
</div>
<div id="outline-container-org9445c63" class="outline-3">
<h3 id="org9445c63"><span class="section-number-3">1.2.</span> 8.01 - Physics I - Classical Mechanics</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-orgcc2594e" class="outline-4">
<h4 id="orgcc2594e"><span class="section-number-4">1.2.1.</span> Sessions 35-37,DD3</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
Complete!
</p>
</div>
</div>
<div id="outline-container-orgdcc7c5e" class="outline-4">
<h4 id="orgdcc7c5e"><span class="section-number-4">1.2.2.</span> Labs</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
There's a version of the course (8.01x) that has labs. Gathering
materials needed for such.
</p>
</div>
<ol class="org-ol">
<li><a id="org25340c4"></a>Lab Power Supply<br />
<div class="outline-text-5" id="text-1-2-2-1">
<p>
One of the lab items needed is a power supply. Why is it that with all
the piles of electronic parts I have, I can't seem to locate an LM317?
Playing around with a design for a mixed switcher and linear supply.
Actually 2 switchers: 24V/2A switcher -&gt; Programmable Buck Switcher -&gt; Programmable Linear.
</p>
</div>
</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org1c11019" class="outline-2">
<h2 id="org1c11019"><span class="section-number-2">2.</span> LA County index map</h2>
<div class="outline-text-2" id="text-2">
<p>
<a href="https://github.com/daniel-kelley/la-ca-6min-index">https://github.com/daniel-kelley/la-ca-6min-index</a>
</p>
</div>
</div>
<div id="outline-container-org2772aa7" class="outline-2">
<h2 id="org2772aa7"><span class="section-number-2">3.</span> Mill Controller #2</h2>
<div class="outline-text-2" id="text-3">
<p>
Planning mill controller upgrade for 2022. Working concept is MachineKit
on BeagleBoard Black. Probably will design own IO board for 5V I/O unless
I can find something that's less expensive than what I can build.
</p>
</div>
</div>
<div id="outline-container-orgd05c6bb" class="outline-2">
<h2 id="orgd05c6bb"><span class="section-number-2">4.</span> WWVB Decoder</h2>
<div class="outline-text-2" id="text-4">
<p>
Prototyped Clock sync PLL. Works against clean waveforms, fails agains
actual waveforms. Need to think about de-noising.
</p>
</div>
</div>
<div id="outline-container-orga136a74" class="outline-2">
<h2 id="orga136a74"><span class="section-number-2">5.</span> Santa Cruz Weather Station</h2>
<div class="outline-text-2" id="text-5">
<p>
Rain Gauge still working.
</p>
</div>
</div>
<div id="outline-container-org6d20cbc" class="outline-2">
<h2 id="org6d20cbc"><span class="section-number-2">6.</span> Marble Computation</h2>
<div class="outline-text-2" id="text-6">
<p>
Collected materials (thin copper plate, copper PCB blanks) for prototyping.
</p>
</div>
<div id="outline-container-org842d5f1" class="outline-3">
<h3 id="org842d5f1"><span class="section-number-3">6.1.</span> Next Steps</h3>
<div class="outline-text-3" id="text-6-1">
</div>
<div id="outline-container-org65a5f32" class="outline-4">
<h4 id="org65a5f32"><span class="section-number-4">6.1.1.</span> Continue Reversible Computation Study</h4>
</div>
<div id="outline-container-org61d27ef" class="outline-4">
<h4 id="org61d27ef"><span class="section-number-4">6.1.2.</span> Prototype Marble inverter</h4>
<div class="outline-text-4" id="text-6-1-2">
<p>
Using dual rail differential logic (left/,right/1), an inverter
merely switches sides. Now thinking an over-center spring controlling
a 'side gate' controlled by a pair of sense levers.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-orgfdb07cd" class="outline-2">
<h2 id="orgfdb07cd"><span class="section-number-2">7.</span> ca-r</h2>
<div class="outline-text-2" id="text-7">
<p>
Issue #33 seems to have fixed itself.
</p>
</div>
<div id="outline-container-org391e7ee" class="outline-3">
<h3 id="org391e7ee"><span class="section-number-3">7.1.</span> Next Step</h3>
<div class="outline-text-3" id="text-7-1">
<p>
Wait for further breakage.
</p>
</div>
</div>
</div>
<div id="outline-container-org8afe8de" class="outline-2">
<h2 id="org8afe8de"><span class="section-number-2">8.</span> us-index-map</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-org8af3292" class="outline-3">
<h3 id="org8af3292"><span class="section-number-3">8.1.</span> error analysis</h3>
<div class="outline-text-3" id="text-8-1">
<p>
Started an error analysis on the USGS topomaps<sub>all.csv</sub> index file. Nothing obvious pops up,
and the error reported by Maureen would be impossible to catch anyway.
</p>
</div>
</div>
</div>
<div id="outline-container-orga37ef4d" class="outline-2">
<h2 id="orga37ef4d"><span class="section-number-2">9.</span> Sun Ultra 10</h2>
<div class="outline-text-2" id="text-9">
<p>
Trying to see what state it is in. Fires up but no video. Need DB25M to
debug over serial port.
</p>
</div>
<div id="outline-container-org1f57dc4" class="outline-3">
<h3 id="org1f57dc4"><span class="section-number-3">9.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-9-1">
</div>
<div id="outline-container-org95310d1" class="outline-4">
<h4 id="org95310d1"><span class="section-number-4">9.1.1.</span> Serial debug</h4>
</div>
</div>
</div>
<div id="outline-container-org5025e1c" class="outline-2">
<h2 id="org5025e1c"><span class="section-number-2">10.</span> Apple iMac G4</h2>
<div class="outline-text-2" id="text-10">
<p>
Building userland may be a PITA due to lack of RAM. Build would often
segfault.
</p>
</div>
<div id="outline-container-org71a4021" class="outline-3">
<h3 id="org71a4021"><span class="section-number-3">10.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-10-1">
<p>
Not sure.
</p>
</div>
</div>
</div>

<div id="outline-container-org4fb4d1d" class="outline-2">
<h2 id="org4fb4d1d"><span class="section-number-2">11.</span> Davies Brothel</h2>
<div class="outline-text-2" id="text-11">
</div>
<div id="outline-container-orgc8aee83" class="outline-3">
<h3 id="orgc8aee83"><span class="section-number-3">11.1.</span> New case C1923172, consolidated with <b>15</b> Parties.</h3>
</div>
<div id="outline-container-orgcb59c2b" class="outline-3">
<h3 id="orgcb59c2b"><span class="section-number-3">11.2.</span> Next hearing 14jan2022. Still no PACER.</h3>
</div>
</div>
<div id="outline-container-orged27513" class="outline-2">
<h2 id="orged27513"><span class="section-number-2">12.</span> Peter Kim</h2>
<div class="outline-text-2" id="text-12">
</div>
<div id="outline-container-org699fcd8" class="outline-3">
<h3 id="org699fcd8"><span class="section-number-3">12.1.</span> Broadcom CSG Employee indicted for trade secret theft.</h3>
</div>
<div id="outline-container-orgcc412fb" class="outline-3">
<h3 id="orgcc412fb"><span class="section-number-3">12.2.</span> United States v. Kim (5:21-cr-00438).</h3>
</div>
<div id="outline-container-org6064acc" class="outline-3">
<h3 id="org6064acc"><span class="section-number-3">12.3.</span> Next hearing: 1/31/2022 01:30 PM</h3>
</div>
</div>
<div id="outline-container-org4d899eb" class="outline-2">
<h2 id="org4d899eb"><span class="section-number-2">13.</span> Linux Audio</h2>
<div class="outline-text-2" id="text-13">
</div>
<div id="outline-container-orgb36445f" class="outline-3">
<h3 id="orgb36445f"><span class="section-number-3">13.1.</span> pvanal to spectrogram</h3>
<div class="outline-text-3" id="text-13-1">
<p>
Enough of libriffr and libpvocf work to start pvoctool
<a href="https://github.com/daniel-kelley/pvoctool">https://github.com/daniel-kelley/pvoctool</a>. Have HDF5 output and
text delimited output for octave. Can import PVOC data to octave
spectrogram for display.
</p>
</div>
<div id="outline-container-org00c2f76" class="outline-4">
<h4 id="org00c2f76"><span class="section-number-4">13.1.1.</span> Next steps</h4>
<div class="outline-text-4" id="text-13-1-1">
<p>
Loop analysis
</p>
</div>
</div>
</div>
<div id="outline-container-org3a5eec7" class="outline-3">
<h3 id="org3a5eec7"><span class="section-number-3">13.2.</span> CSound programming.</h3>
<div class="outline-text-3" id="text-13-2">
<p>
The FORTRAN of computer music. Getting up to speed.
</p>
</div>
<div id="outline-container-org7132420" class="outline-4">
<h4 id="org7132420"><span class="section-number-4">13.2.1.</span> Next Steps</h4>
<div class="outline-text-4" id="text-13-2-1">
</div>
<ol class="org-ol">
<li><a id="orge4a13c9"></a>loscil demo<br /></li>
<li><a id="org72d5f1c"></a>spectrogram loop point analysis<br /></li>
</ol>
</div>
</div>
<div id="outline-container-org84d80bc" class="outline-3">
<h3 id="org84d80bc"><span class="section-number-3">13.3.</span> Faust programming</h3>
<div class="outline-text-3" id="text-13-3">
</div>
<div id="outline-container-orgdb945d0" class="outline-4">
<h4 id="orgdb945d0"><span class="section-number-4">13.3.1.</span> Next Steps</h4>
<div class="outline-text-4" id="text-13-3-1">
</div>
<ol class="org-ol">
<li><a id="org77cd6a5"></a>GAC Patch save/restore<br /></li>
<li><a id="orgb880f6c"></a>LV2 autopatcher<br />
<div class="outline-text-5" id="text-13-3-1-2">
<p>
Exploratory tool to generate (was pd, ecasound, now carla) patch for arbitrary LV2 plugin:
hook up audio inputs to signal source, audio outputs to speakers, control inputs to
control surface, etc.
</p>
</div>
</li>
<li><a id="org1469cd0"></a>OSC control surface<br />
<div class="outline-text-5" id="text-13-3-1-3">
<p>
Some sort of GUI tool (knob/slider) to OSC messages. This may be
as simple as a Faust UI program.
</p>
</div>
</li>
<li><a id="org02d0c3e"></a>Faust/csound<br />
<div class="outline-text-5" id="text-13-3-1-4">
<p>
See if a faust generated unit works.
</p>
</div>
</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orgb85b0b3" class="outline-2">
<h2 id="orgb85b0b3"><span class="section-number-2">14.</span> EPICS</h2>
<div class="outline-text-2" id="text-14">
</div>
<div id="outline-container-orge69b13c" class="outline-3">
<h3 id="orge69b13c"><span class="section-number-3">14.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-14-1">
</div>
<div id="outline-container-org4a8abc8" class="outline-4">
<h4 id="org4a8abc8"><span class="section-number-4">14.1.1.</span> Started CGR-101 SCPI interface</h4>
<div class="outline-text-4" id="text-14-1-1">
</div>
<ol class="org-ol">
<li><a id="org02bea9c"></a>Will help test u3scpi<br /></li>
<li><a id="org5f0e385"></a>Using flex/bison SCPI parser<br />
<div class="outline-text-5" id="text-14-1-1-2">
<p>
Output queue, unit tests. ~50% system commands done.
</p>
</div>
</li>
</ol>
</div>
<div id="outline-container-org1620777" class="outline-4">
<h4 id="org1620777"><span class="section-number-4">14.1.2.</span> u3scpi network port testing</h4>
</div>
<div id="outline-container-orga3eeb91" class="outline-4">
<h4 id="orga3eeb91"><span class="section-number-4">14.1.3.</span> initial EPICS interface</h4>
</div>
<div id="outline-container-orgd37c859" class="outline-4">
<h4 id="orgd37c859"><span class="section-number-4">14.1.4.</span> u3scpi analog/digital port reconfiguration.</h4>
</div>
</div>
</div>

<div id="outline-container-orgd7aaa62" class="outline-2">
<h2 id="orgd7aaa62"><span class="section-number-2">15.</span> Brini Tracker II</h2>
<div class="outline-text-2" id="text-15">
<p>
Maybe this can be simplified to just the GPS module in 'tracking' mode
(which gets carried around), and a separate docking module to extract
the data.
</p>
</div>
<div id="outline-container-org6879e74" class="outline-3">
<h3 id="org6879e74"><span class="section-number-3">15.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-15-1">
</div>
<div id="outline-container-orgf489e61" class="outline-4">
<h4 id="orgf489e61"><span class="section-number-4">15.1.1.</span> Validate remaining standard GPS messages</h4>
</div>
<div id="outline-container-org2c20fe7" class="outline-4">
<h4 id="org2c20fe7"><span class="section-number-4">15.1.2.</span> Investigate GPS chipset data logging</h4>
</div>
<div id="outline-container-org87e3ed5" class="outline-4">
<h4 id="org87e3ed5"><span class="section-number-4">15.1.3.</span> Investigate LoRA radio interface</h4>
</div>
</div>
</div>

<div id="outline-container-orgb19bd04" class="outline-2">
<h2 id="orgb19bd04"><span class="section-number-2">16.</span> wktcolor</h2>
<div class="outline-text-2" id="text-16">
</div>
<div id="outline-container-orgb73541d" class="outline-3">
<h3 id="orgb73541d"><span class="section-number-3">16.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-16-1">
</div>
<div id="outline-container-orgd930ba2" class="outline-4">
<h4 id="orgd930ba2"><span class="section-number-4">16.1.1.</span> Explore how to get a minimal coloring</h4>
<div class="outline-text-4" id="text-16-1-1">
<p>
Need a specific planar graph four coloring.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org22249a3" class="outline-2">
<h2 id="org22249a3"><span class="section-number-2">17.</span> wktplot</h2>
<div class="outline-text-2" id="text-17">
</div>
<div id="outline-container-orgf864c32" class="outline-3">
<h3 id="orgf864c32"><span class="section-number-3">17.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-17-1">
<p>
Understand why -r doesn't solve the wktvor/wktdel "sliver at edge" problem.
Explore biological cell Voronoi organization
</p>
</div>
</div>
</div>

<div id="outline-container-orga38515d" class="outline-2">
<h2 id="orga38515d"><span class="section-number-2">18.</span> AMDGPU</h2>
<div class="outline-text-2" id="text-18">
</div>
<div id="outline-container-org30f6d15" class="outline-3">
<h3 id="org30f6d15"><span class="section-number-3">18.1.</span> Next step</h3>
<div class="outline-text-3" id="text-18-1">
</div>
<div id="outline-container-org3ed3f71" class="outline-4">
<h4 id="org3ed3f71"><span class="section-number-4">18.1.1.</span> Reverse engineer HSAKMT programming.</h4>
</div>
</div>
</div>

<div id="outline-container-org1c69e10" class="outline-2">
<h2 id="org1c69e10"><span class="section-number-2">19.</span> Ninja v Make</h2>
<div class="outline-text-2" id="text-19">
</div>
<div id="outline-container-orgc832e60" class="outline-3">
<h3 id="orgc832e60"><span class="section-number-3">19.1.</span> Next Step</h3>
<div class="outline-text-3" id="text-19-1">
</div>
<div id="outline-container-org95b7764" class="outline-4">
<h4 id="org95b7764"><span class="section-number-4">19.1.1.</span> clean simple measurements</h4>
</div>
</div>
</div>

<div id="outline-container-orge0419da" class="outline-2">
<h2 id="orge0419da"><span class="section-number-2">20.</span> GMP Forth</h2>
<div class="outline-text-2" id="text-20">
</div>
<div id="outline-container-org52d4023" class="outline-3">
<h3 id="org52d4023"><span class="section-number-3">20.1.</span> Need to think about adding floating point support</h3>
</div>
<div id="outline-container-org6749e60" class="outline-3">
<h3 id="org6749e60"><span class="section-number-3">20.2.</span> Port to non-Linux OS</h3>
</div>
</div>
<div id="outline-container-org2e20bf7" class="outline-2">
<h2 id="org2e20bf7"><span class="section-number-2">21.</span> Swocer</h2>
<div class="outline-text-2" id="text-21">
</div>
<div id="outline-container-org3fc9146" class="outline-3">
<h3 id="org3fc9146"><span class="section-number-3">21.1.</span> Most crashing addressed</h3>
<div class="outline-text-3" id="text-21-1">
<p>
Nullified 'handle' API free functions helped a lot.
Still see some errors in operations.
</p>
</div>
</div>
<div id="outline-container-orgb206532" class="outline-3">
<h3 id="orgb206532"><span class="section-number-3">21.2.</span> Added outline for 'bottle' test</h3>
<div class="outline-text-3" id="text-21-2">
<p>
Added all functions believed to be needed for 'bottle' demo test.
Test doesn't pass so is disabled.
</p>
</div>
</div>
<div id="outline-container-orgcf5f7b1" class="outline-3">
<h3 id="orgcf5f7b1"><span class="section-number-3">21.3.</span> Next steps</h3>
<div class="outline-text-3" id="text-21-3">
<p>
Swocer future.
Check out what's needed for gears.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Daniel Kelley</p>
<p class="date">Created: 2023-01-28 Sat 07:05</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
